# CorrectionFactorSet Class

---
A set that contains correction factors.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalCorrectionFactorSet
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class CorrectionFactorSet : APIObject,
    	IEnumerable

    Public Class CorrectionFactorSet
    	Inherits APIObject
    	Implements IEnumerable

    public ref class CorrectionFactorSet : public APIObject,
    	IEnumerable

    type CorrectionFactorSet =
        class
            inherit APIObject
            interface IEnumerable
        end
The CorrectionFactorSet type exposes the following members.
| Name| Description
---|---|---
| CorrectionFactorSet| Initializes a new instance of the CorrectionFactorSet class
Top
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of correction factors that are in the set.
Top
| Name| Description
---|---|---
| Clear| Removes every correction factor from the set, rendering it empty.
| Contains|
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| Erase|
| ForwardIterator| Retrieve a forward moving iterator to the set.
| GetEnumerator| Retrieve a forward moving iterator to the set.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Insert|
| ReverseIterator| Retrieve a backward moving iterator to the set.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Electrical Namespace